{
  "vocab_size": 32000,
  "max_position_embeddings": 4096,
  "hidden_size": 4096,
  "intermediate_size": 11008,
  "num_hidden_layers": 32,
  "num_attention_heads": 32,
  "num_key_value_heads": 32,
  "hidden_act": "silu",
  "initializer_range": 0.02,
  "rms_norm_eps": 1e-05,
  "pretraining_tp": 1,
  "use_cache": true,
  "rope_theta": 10000.0,
  "rope_scaling": null,
  "attention_bias": false,
  "attention_dropout": 0.0,
  "return_dict": true,
  "output_hidden_states": false,
  "output_attentions": false,
  "torchscript": false,
  "torch_dtype": "float16",
  "use_bfloat16": false,
  "tf_legacy_loss": false,
  "pruned_heads": {},
  "tie_word_embeddings": false,
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": false,
  "is_decoder": false,
  "cross_attention_hidden_size": null,
  "add_cross_attention": false,
  "tie_encoder_decoder": false,
  "max_length": 20,
  "min_length": 0,
  "do_sample": false,
  "early_stopping": false,
  "num_beams": 1,
  "num_beam_groups": 1,
  "diversity_penalty": 0.0,
  "temperature": 1.0,
  "top_k": 50,
  "top_p": 1.0,
  "typical_p": 1.0,
  "repetition_penalty": 1.0,
  "length_penalty": 1.0,
  "no_repeat_ngram_size": 0,
  "encoder_no_repeat_ngram_size": 0,
  "bad_words_ids": null,
  "num_return_sequences": 1,
  "output_scores": false,
  "return_dict_in_generate": false,
  "forced_bos_token_id": null,
  "forced_eos_token_id": null,
  "remove_invalid_values": false,
  "exponential_decay_length_penalty": null,
  "suppress_tokens": null,
  "begin_suppress_tokens": null,
  "architectures": [
    "ASVDLlamaForCausalLM"
  ],
  "finetuning_task": null,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1"
  },
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1
  },
  "tokenizer_class": null,
  "prefix": null,
  "bos_token_id": 1,
  "pad_token_id": null,
  "eos_token_id": 2,
  "sep_token_id": null,
  "decoder_start_token_id": null,
  "task_specific_params": null,
  "problem_type": null,
  "_name_or_path": "meta-llama/Llama-2-7b-hf",
  "transformers_version": "4.37.2",
  "model_type": "svdllama",
  "truncation_ranks": {
    "model.layers.0.self_attn.q_proj": 1638,
    "model.layers.0.self_attn.k_proj": 1638,
    "model.layers.0.self_attn.v_proj": 1638,
    "model.layers.0.self_attn.o_proj": 1638,
    "model.layers.0.mlp.gate_proj": 2388,
    "model.layers.0.mlp.up_proj": 2388,
    "model.layers.0.mlp.down_proj": 2388,
    "model.layers.1.self_attn.q_proj": 1638,
    "model.layers.1.self_attn.k_proj": 1638,
    "model.layers.1.self_attn.v_proj": 1638,
    "model.layers.1.self_attn.o_proj": 1638,
    "model.layers.1.mlp.gate_proj": 2388,
    "model.layers.1.mlp.up_proj": 2388,
    "model.layers.1.mlp.down_proj": 2388,
    "model.layers.2.self_attn.q_proj": 1638,
    "model.layers.2.self_attn.k_proj": 1638,
    "model.layers.2.self_attn.v_proj": 1638,
    "model.layers.2.self_attn.o_proj": 1638,
    "model.layers.2.mlp.gate_proj": 2388,
    "model.layers.2.mlp.up_proj": 2388,
    "model.layers.2.mlp.down_proj": 2388,
    "model.layers.3.self_attn.q_proj": 1638,
    "model.layers.3.self_attn.k_proj": 1638,
    "model.layers.3.self_attn.v_proj": 1638,
    "model.layers.3.self_attn.o_proj": 1638,
    "model.layers.3.mlp.gate_proj": 2388,
    "model.layers.3.mlp.up_proj": 2388,
    "model.layers.3.mlp.down_proj": 2388,
    "model.layers.4.self_attn.q_proj": 1638,
    "model.layers.4.self_attn.k_proj": 1638,
    "model.layers.4.self_attn.v_proj": 1638,
    "model.layers.4.self_attn.o_proj": 1638,
    "model.layers.4.mlp.gate_proj": 2388,
    "model.layers.4.mlp.up_proj": 2388,
    "model.layers.4.mlp.down_proj": 2388,
    "model.layers.5.self_attn.q_proj": 1638,
    "model.layers.5.self_attn.k_proj": 1638,
    "model.layers.5.self_attn.v_proj": 1638,
    "model.layers.5.self_attn.o_proj": 1638,
    "model.layers.5.mlp.gate_proj": 2388,
    "model.layers.5.mlp.up_proj": 2388,
    "model.layers.5.mlp.down_proj": 2388,
    "model.layers.6.self_attn.q_proj": 1638,
    "model.layers.6.self_attn.k_proj": 1638,
    "model.layers.6.self_attn.v_proj": 1638,
    "model.layers.6.self_attn.o_proj": 1638,
    "model.layers.6.mlp.gate_proj": 2388,
    "model.layers.6.mlp.up_proj": 2388,
    "model.layers.6.mlp.down_proj": 2388,
    "model.layers.7.self_attn.q_proj": 1638,
    "model.layers.7.self_attn.k_proj": 1638,
    "model.layers.7.self_attn.v_proj": 1638,
    "model.layers.7.self_attn.o_proj": 1638,
    "model.layers.7.mlp.gate_proj": 2388,
    "model.layers.7.mlp.up_proj": 2388,
    "model.layers.7.mlp.down_proj": 2388,
    "model.layers.8.self_attn.q_proj": 1638,
    "model.layers.8.self_attn.k_proj": 1638,
    "model.layers.8.self_attn.v_proj": 1638,
    "model.layers.8.self_attn.o_proj": 1638,
    "model.layers.8.mlp.gate_proj": 2388,
    "model.layers.8.mlp.up_proj": 2388,
    "model.layers.8.mlp.down_proj": 2388,
    "model.layers.9.self_attn.q_proj": 1638,
    "model.layers.9.self_attn.k_proj": 1638,
    "model.layers.9.self_attn.v_proj": 1638,
    "model.layers.9.self_attn.o_proj": 1638,
    "model.layers.9.mlp.gate_proj": 2388,
    "model.layers.9.mlp.up_proj": 2388,
    "model.layers.9.mlp.down_proj": 2388,
    "model.layers.10.self_attn.q_proj": 1638,
    "model.layers.10.self_attn.k_proj": 1638,
    "model.layers.10.self_attn.v_proj": 1638,
    "model.layers.10.self_attn.o_proj": 1638,
    "model.layers.10.mlp.gate_proj": 2388,
    "model.layers.10.mlp.up_proj": 2388,
    "model.layers.10.mlp.down_proj": 2388,
    "model.layers.11.self_attn.q_proj": 1638,
    "model.layers.11.self_attn.k_proj": 1638,
    "model.layers.11.self_attn.v_proj": 1638,
    "model.layers.11.self_attn.o_proj": 1638,
    "model.layers.11.mlp.gate_proj": 2388,
    "model.layers.11.mlp.up_proj": 2388,
    "model.layers.11.mlp.down_proj": 2388,
    "model.layers.12.self_attn.q_proj": 1638,
    "model.layers.12.self_attn.k_proj": 1638,
    "model.layers.12.self_attn.v_proj": 1638,
    "model.layers.12.self_attn.o_proj": 1638,
    "model.layers.12.mlp.gate_proj": 2388,
    "model.layers.12.mlp.up_proj": 2388,
    "model.layers.12.mlp.down_proj": 2388,
    "model.layers.13.self_attn.q_proj": 1638,
    "model.layers.13.self_attn.k_proj": 1638,
    "model.layers.13.self_attn.v_proj": 1638,
    "model.layers.13.self_attn.o_proj": 1638,
    "model.layers.13.mlp.gate_proj": 2388,
    "model.layers.13.mlp.up_proj": 2388,
    "model.layers.13.mlp.down_proj": 2388,
    "model.layers.14.self_attn.q_proj": 1638,
    "model.layers.14.self_attn.k_proj": 1638,
    "model.layers.14.self_attn.v_proj": 1638,
    "model.layers.14.self_attn.o_proj": 1638,
    "model.layers.14.mlp.gate_proj": 2388,
    "model.layers.14.mlp.up_proj": 2388,
    "model.layers.14.mlp.down_proj": 2388,
    "model.layers.15.self_attn.q_proj": 1638,
    "model.layers.15.self_attn.k_proj": 1638,
    "model.layers.15.self_attn.v_proj": 1638,
    "model.layers.15.self_attn.o_proj": 1638,
    "model.layers.15.mlp.gate_proj": 2388,
    "model.layers.15.mlp.up_proj": 2388,
    "model.layers.15.mlp.down_proj": 2388,
    "model.layers.16.self_attn.q_proj": 1638,
    "model.layers.16.self_attn.k_proj": 1638,
    "model.layers.16.self_attn.v_proj": 1638,
    "model.layers.16.self_attn.o_proj": 1638,
    "model.layers.16.mlp.gate_proj": 2388,
    "model.layers.16.mlp.up_proj": 2388,
    "model.layers.16.mlp.down_proj": 2388,
    "model.layers.17.self_attn.q_proj": 1638,
    "model.layers.17.self_attn.k_proj": 1638,
    "model.layers.17.self_attn.v_proj": 1638,
    "model.layers.17.self_attn.o_proj": 1638,
    "model.layers.17.mlp.gate_proj": 2388,
    "model.layers.17.mlp.up_proj": 2388,
    "model.layers.17.mlp.down_proj": 2388,
    "model.layers.18.self_attn.q_proj": 1638,
    "model.layers.18.self_attn.k_proj": 1638,
    "model.layers.18.self_attn.v_proj": 1638,
    "model.layers.18.self_attn.o_proj": 1638,
    "model.layers.18.mlp.gate_proj": 2388,
    "model.layers.18.mlp.up_proj": 2388,
    "model.layers.18.mlp.down_proj": 2388,
    "model.layers.19.self_attn.q_proj": 1638,
    "model.layers.19.self_attn.k_proj": 1638,
    "model.layers.19.self_attn.v_proj": 1638,
    "model.layers.19.self_attn.o_proj": 1638,
    "model.layers.19.mlp.gate_proj": 2388,
    "model.layers.19.mlp.up_proj": 2388,
    "model.layers.19.mlp.down_proj": 2388,
    "model.layers.20.self_attn.q_proj": 1638,
    "model.layers.20.self_attn.k_proj": 1638,
    "model.layers.20.self_attn.v_proj": 1638,
    "model.layers.20.self_attn.o_proj": 1638,
    "model.layers.20.mlp.gate_proj": 2388,
    "model.layers.20.mlp.up_proj": 2388,
    "model.layers.20.mlp.down_proj": 2388,
    "model.layers.21.self_attn.q_proj": 1638,
    "model.layers.21.self_attn.k_proj": 1638,
    "model.layers.21.self_attn.v_proj": 1638,
    "model.layers.21.self_attn.o_proj": 1638,
    "model.layers.21.mlp.gate_proj": 2388,
    "model.layers.21.mlp.up_proj": 2388,
    "model.layers.21.mlp.down_proj": 2388,
    "model.layers.22.self_attn.q_proj": 1638,
    "model.layers.22.self_attn.k_proj": 1638,
    "model.layers.22.self_attn.v_proj": 1638,
    "model.layers.22.self_attn.o_proj": 1638,
    "model.layers.22.mlp.gate_proj": 2388,
    "model.layers.22.mlp.up_proj": 2388,
    "model.layers.22.mlp.down_proj": 2388,
    "model.layers.23.self_attn.q_proj": 1638,
    "model.layers.23.self_attn.k_proj": 1638,
    "model.layers.23.self_attn.v_proj": 1638,
    "model.layers.23.self_attn.o_proj": 1638,
    "model.layers.23.mlp.gate_proj": 2388,
    "model.layers.23.mlp.up_proj": 2388,
    "model.layers.23.mlp.down_proj": 2388,
    "model.layers.24.self_attn.q_proj": 1638,
    "model.layers.24.self_attn.k_proj": 1638,
    "model.layers.24.self_attn.v_proj": 1638,
    "model.layers.24.self_attn.o_proj": 1638,
    "model.layers.24.mlp.gate_proj": 2388,
    "model.layers.24.mlp.up_proj": 2388,
    "model.layers.24.mlp.down_proj": 2388,
    "model.layers.25.self_attn.q_proj": 1638,
    "model.layers.25.self_attn.k_proj": 1638,
    "model.layers.25.self_attn.v_proj": 1638,
    "model.layers.25.self_attn.o_proj": 1638,
    "model.layers.25.mlp.gate_proj": 2388,
    "model.layers.25.mlp.up_proj": 2388,
    "model.layers.25.mlp.down_proj": 2388,
    "model.layers.26.self_attn.q_proj": 1638,
    "model.layers.26.self_attn.k_proj": 1638,
    "model.layers.26.self_attn.v_proj": 1638,
    "model.layers.26.self_attn.o_proj": 1638,
    "model.layers.26.mlp.gate_proj": 2388,
    "model.layers.26.mlp.up_proj": 2388,
    "model.layers.26.mlp.down_proj": 2388,
    "model.layers.27.self_attn.q_proj": 1638,
    "model.layers.27.self_attn.k_proj": 1638,
    "model.layers.27.self_attn.v_proj": 1638,
    "model.layers.27.self_attn.o_proj": 1638,
    "model.layers.27.mlp.gate_proj": 2388,
    "model.layers.27.mlp.up_proj": 2388,
    "model.layers.27.mlp.down_proj": 2388,
    "model.layers.28.self_attn.q_proj": 1638,
    "model.layers.28.self_attn.k_proj": 1638,
    "model.layers.28.self_attn.v_proj": 1638,
    "model.layers.28.self_attn.o_proj": 1638,
    "model.layers.28.mlp.gate_proj": 2388,
    "model.layers.28.mlp.up_proj": 2388,
    "model.layers.28.mlp.down_proj": 2388,
    "model.layers.29.self_attn.q_proj": 1638,
    "model.layers.29.self_attn.k_proj": 1638,
    "model.layers.29.self_attn.v_proj": 1638,
    "model.layers.29.self_attn.o_proj": 1638,
    "model.layers.29.mlp.gate_proj": 2388,
    "model.layers.29.mlp.up_proj": 2388,
    "model.layers.29.mlp.down_proj": 2388,
    "model.layers.30.self_attn.q_proj": 1638,
    "model.layers.30.self_attn.k_proj": 1638,
    "model.layers.30.self_attn.v_proj": 1638,
    "model.layers.30.self_attn.o_proj": 1638,
    "model.layers.30.mlp.gate_proj": 2388,
    "model.layers.30.mlp.up_proj": 2388,
    "model.layers.30.mlp.down_proj": 2388,
    "model.layers.31.self_attn.q_proj": 1638,
    "model.layers.31.self_attn.k_proj": 1638,
    "model.layers.31.self_attn.v_proj": 1638,
    "model.layers.31.self_attn.o_proj": 1638,
    "model.layers.31.mlp.gate_proj": 2388,
    "model.layers.31.mlp.up_proj": 2388,
    "model.layers.31.mlp.down_proj": 2388
  },
  "succinct_splits": {
    "model.layers.0.self_attn.q_proj": "A",
    "model.layers.0.self_attn.k_proj": "A",
    "model.layers.0.self_attn.v_proj": "A",
    "model.layers.0.self_attn.o_proj": "A",
    "model.layers.0.mlp.gate_proj": "A",
    "model.layers.0.mlp.up_proj": "A",
    "model.layers.0.mlp.down_proj": "A",
    "model.layers.1.self_attn.q_proj": "A",
    "model.layers.1.self_attn.k_proj": "A",
    "model.layers.1.self_attn.v_proj": "A",
    "model.layers.1.self_attn.o_proj": "A",
    "model.layers.1.mlp.gate_proj": "A",
    "model.layers.1.mlp.up_proj": "A",
    "model.layers.1.mlp.down_proj": "A",
    "model.layers.2.self_attn.q_proj": "A",
    "model.layers.2.self_attn.k_proj": "A",
    "model.layers.2.self_attn.v_proj": "A",
    "model.layers.2.self_attn.o_proj": "A",
    "model.layers.2.mlp.gate_proj": "A",
    "model.layers.2.mlp.up_proj": "A",
    "model.layers.2.mlp.down_proj": "A",
    "model.layers.3.self_attn.q_proj": "A",
    "model.layers.3.self_attn.k_proj": "A",
    "model.layers.3.self_attn.v_proj": "A",
    "model.layers.3.self_attn.o_proj": "A",
    "model.layers.3.mlp.gate_proj": "A",
    "model.layers.3.mlp.up_proj": "A",
    "model.layers.3.mlp.down_proj": "A",
    "model.layers.4.self_attn.q_proj": "A",
    "model.layers.4.self_attn.k_proj": "A",
    "model.layers.4.self_attn.v_proj": "A",
    "model.layers.4.self_attn.o_proj": "A",
    "model.layers.4.mlp.gate_proj": "A",
    "model.layers.4.mlp.up_proj": "A",
    "model.layers.4.mlp.down_proj": "A",
    "model.layers.5.self_attn.q_proj": "A",
    "model.layers.5.self_attn.k_proj": "A",
    "model.layers.5.self_attn.v_proj": "A",
    "model.layers.5.self_attn.o_proj": "A",
    "model.layers.5.mlp.gate_proj": "A",
    "model.layers.5.mlp.up_proj": "A",
    "model.layers.5.mlp.down_proj": "A",
    "model.layers.6.self_attn.q_proj": "A",
    "model.layers.6.self_attn.k_proj": "A",
    "model.layers.6.self_attn.v_proj": "A",
    "model.layers.6.self_attn.o_proj": "A",
    "model.layers.6.mlp.gate_proj": "A",
    "model.layers.6.mlp.up_proj": "A",
    "model.layers.6.mlp.down_proj": "A",
    "model.layers.7.self_attn.q_proj": "A",
    "model.layers.7.self_attn.k_proj": "A",
    "model.layers.7.self_attn.v_proj": "A",
    "model.layers.7.self_attn.o_proj": "A",
    "model.layers.7.mlp.gate_proj": "A",
    "model.layers.7.mlp.up_proj": "A",
    "model.layers.7.mlp.down_proj": "A",
    "model.layers.8.self_attn.q_proj": "A",
    "model.layers.8.self_attn.k_proj": "A",
    "model.layers.8.self_attn.v_proj": "A",
    "model.layers.8.self_attn.o_proj": "A",
    "model.layers.8.mlp.gate_proj": "A",
    "model.layers.8.mlp.up_proj": "A",
    "model.layers.8.mlp.down_proj": "A",
    "model.layers.9.self_attn.q_proj": "A",
    "model.layers.9.self_attn.k_proj": "A",
    "model.layers.9.self_attn.v_proj": "A",
    "model.layers.9.self_attn.o_proj": "A",
    "model.layers.9.mlp.gate_proj": "A",
    "model.layers.9.mlp.up_proj": "A",
    "model.layers.9.mlp.down_proj": "A",
    "model.layers.10.self_attn.q_proj": "A",
    "model.layers.10.self_attn.k_proj": "A",
    "model.layers.10.self_attn.v_proj": "A",
    "model.layers.10.self_attn.o_proj": "A",
    "model.layers.10.mlp.gate_proj": "A",
    "model.layers.10.mlp.up_proj": "A",
    "model.layers.10.mlp.down_proj": "A",
    "model.layers.11.self_attn.q_proj": "A",
    "model.layers.11.self_attn.k_proj": "A",
    "model.layers.11.self_attn.v_proj": "A",
    "model.layers.11.self_attn.o_proj": "A",
    "model.layers.11.mlp.gate_proj": "A",
    "model.layers.11.mlp.up_proj": "A",
    "model.layers.11.mlp.down_proj": "A",
    "model.layers.12.self_attn.q_proj": "A",
    "model.layers.12.self_attn.k_proj": "A",
    "model.layers.12.self_attn.v_proj": "A",
    "model.layers.12.self_attn.o_proj": "A",
    "model.layers.12.mlp.gate_proj": "A",
    "model.layers.12.mlp.up_proj": "A",
    "model.layers.12.mlp.down_proj": "A",
    "model.layers.13.self_attn.q_proj": "A",
    "model.layers.13.self_attn.k_proj": "A",
    "model.layers.13.self_attn.v_proj": "A",
    "model.layers.13.self_attn.o_proj": "A",
    "model.layers.13.mlp.gate_proj": "A",
    "model.layers.13.mlp.up_proj": "A",
    "model.layers.13.mlp.down_proj": "A",
    "model.layers.14.self_attn.q_proj": "A",
    "model.layers.14.self_attn.k_proj": "A",
    "model.layers.14.self_attn.v_proj": "A",
    "model.layers.14.self_attn.o_proj": "A",
    "model.layers.14.mlp.gate_proj": "A",
    "model.layers.14.mlp.up_proj": "A",
    "model.layers.14.mlp.down_proj": "A",
    "model.layers.15.self_attn.q_proj": "A",
    "model.layers.15.self_attn.k_proj": "A",
    "model.layers.15.self_attn.v_proj": "A",
    "model.layers.15.self_attn.o_proj": "A",
    "model.layers.15.mlp.gate_proj": "A",
    "model.layers.15.mlp.up_proj": "A",
    "model.layers.15.mlp.down_proj": "A",
    "model.layers.16.self_attn.q_proj": "A",
    "model.layers.16.self_attn.k_proj": "A",
    "model.layers.16.self_attn.v_proj": "A",
    "model.layers.16.self_attn.o_proj": "A",
    "model.layers.16.mlp.gate_proj": "A",
    "model.layers.16.mlp.up_proj": "A",
    "model.layers.16.mlp.down_proj": "A",
    "model.layers.17.self_attn.q_proj": "A",
    "model.layers.17.self_attn.k_proj": "A",
    "model.layers.17.self_attn.v_proj": "A",
    "model.layers.17.self_attn.o_proj": "A",
    "model.layers.17.mlp.gate_proj": "A",
    "model.layers.17.mlp.up_proj": "A",
    "model.layers.17.mlp.down_proj": "A",
    "model.layers.18.self_attn.q_proj": "A",
    "model.layers.18.self_attn.k_proj": "A",
    "model.layers.18.self_attn.v_proj": "A",
    "model.layers.18.self_attn.o_proj": "A",
    "model.layers.18.mlp.gate_proj": "A",
    "model.layers.18.mlp.up_proj": "A",
    "model.layers.18.mlp.down_proj": "A",
    "model.layers.19.self_attn.q_proj": "A",
    "model.layers.19.self_attn.k_proj": "A",
    "model.layers.19.self_attn.v_proj": "A",
    "model.layers.19.self_attn.o_proj": "A",
    "model.layers.19.mlp.gate_proj": "A",
    "model.layers.19.mlp.up_proj": "A",
    "model.layers.19.mlp.down_proj": "A",
    "model.layers.20.self_attn.q_proj": "A",
    "model.layers.20.self_attn.k_proj": "A",
    "model.layers.20.self_attn.v_proj": "A",
    "model.layers.20.self_attn.o_proj": "A",
    "model.layers.20.mlp.gate_proj": "A",
    "model.layers.20.mlp.up_proj": "A",
    "model.layers.20.mlp.down_proj": "A",
    "model.layers.21.self_attn.q_proj": "A",
    "model.layers.21.self_attn.k_proj": "A",
    "model.layers.21.self_attn.v_proj": "A",
    "model.layers.21.self_attn.o_proj": "A",
    "model.layers.21.mlp.gate_proj": "A",
    "model.layers.21.mlp.up_proj": "A",
    "model.layers.21.mlp.down_proj": "A",
    "model.layers.22.self_attn.q_proj": "A",
    "model.layers.22.self_attn.k_proj": "A",
    "model.layers.22.self_attn.v_proj": "A",
    "model.layers.22.self_attn.o_proj": "A",
    "model.layers.22.mlp.gate_proj": "A",
    "model.layers.22.mlp.up_proj": "A",
    "model.layers.22.mlp.down_proj": "A",
    "model.layers.23.self_attn.q_proj": "A",
    "model.layers.23.self_attn.k_proj": "A",
    "model.layers.23.self_attn.v_proj": "A",
    "model.layers.23.self_attn.o_proj": "A",
    "model.layers.23.mlp.gate_proj": "A",
    "model.layers.23.mlp.up_proj": "A",
    "model.layers.23.mlp.down_proj": "A",
    "model.layers.24.self_attn.q_proj": "A",
    "model.layers.24.self_attn.k_proj": "A",
    "model.layers.24.self_attn.v_proj": "A",
    "model.layers.24.self_attn.o_proj": "A",
    "model.layers.24.mlp.gate_proj": "A",
    "model.layers.24.mlp.up_proj": "A",
    "model.layers.24.mlp.down_proj": "A",
    "model.layers.25.self_attn.q_proj": "A",
    "model.layers.25.self_attn.k_proj": "A",
    "model.layers.25.self_attn.v_proj": "A",
    "model.layers.25.self_attn.o_proj": "A",
    "model.layers.25.mlp.gate_proj": "A",
    "model.layers.25.mlp.up_proj": "A",
    "model.layers.25.mlp.down_proj": "A",
    "model.layers.26.self_attn.q_proj": "A",
    "model.layers.26.self_attn.k_proj": "A",
    "model.layers.26.self_attn.v_proj": "A",
    "model.layers.26.self_attn.o_proj": "A",
    "model.layers.26.mlp.gate_proj": "A",
    "model.layers.26.mlp.up_proj": "A",
    "model.layers.26.mlp.down_proj": "A",
    "model.layers.27.self_attn.q_proj": "A",
    "model.layers.27.self_attn.k_proj": "A",
    "model.layers.27.self_attn.v_proj": "A",
    "model.layers.27.self_attn.o_proj": "A",
    "model.layers.27.mlp.gate_proj": "A",
    "model.layers.27.mlp.up_proj": "A",
    "model.layers.27.mlp.down_proj": "A",
    "model.layers.28.self_attn.q_proj": "A",
    "model.layers.28.self_attn.k_proj": "A",
    "model.layers.28.self_attn.v_proj": "A",
    "model.layers.28.self_attn.o_proj": "A",
    "model.layers.28.mlp.gate_proj": "A",
    "model.layers.28.mlp.up_proj": "A",
    "model.layers.28.mlp.down_proj": "A",
    "model.layers.29.self_attn.q_proj": "A",
    "model.layers.29.self_attn.k_proj": "A",
    "model.layers.29.self_attn.v_proj": "A",
    "model.layers.29.self_attn.o_proj": "A",
    "model.layers.29.mlp.gate_proj": "A",
    "model.layers.29.mlp.up_proj": "A",
    "model.layers.29.mlp.down_proj": "A",
    "model.layers.30.self_attn.q_proj": "A",
    "model.layers.30.self_attn.k_proj": "A",
    "model.layers.30.self_attn.v_proj": "A",
    "model.layers.30.self_attn.o_proj": "A",
    "model.layers.30.mlp.gate_proj": "A",
    "model.layers.30.mlp.up_proj": "A",
    "model.layers.30.mlp.down_proj": "A",
    "model.layers.31.self_attn.q_proj": "A",
    "model.layers.31.self_attn.k_proj": "A",
    "model.layers.31.self_attn.v_proj": "A",
    "model.layers.31.self_attn.o_proj": "A",
    "model.layers.31.mlp.gate_proj": "A",
    "model.layers.31.mlp.up_proj": "A",
    "model.layers.31.mlp.down_proj": "A"
  }
}